[{"Title":" how can i create an html button that copies selected text to the clients clipboard?","tags":"<javascript><html><copy><clipboard>","Answer_Body":"#Most cross-browser implementations use Flash to get past security restrictions. AFAIK, there isn't a W3C standard for accessing the system pasteboard.\n\n#I've used Clippy in the past. It's lightweight and fast and does just what it says on the box.\n"},{"Title":" need to trigger an event on a video ending","tags":"<javascript><video><triggers>","Answer_Body":"\n  #I am looking to hide the player and show a div block with javascript upon video finishing.\n\n\n#Look in the docs of your video player whether it has an event for it; if it doesn't, change players. \n\n#JPlayer has events, for example.\n"},{"Title":"! preceding function in javascript?","tags":"<javascript>","Answer_Body":"#The preceding ! takes the un-parseable statement, and allows it to to be parsed by the JS engine, which in turn returns true.\n\nfunction(){}();\nSyntaxError: Unexpected token (\n\n!function(){}();\n&gt;&gt;true\n\n"},{"Title":"!important inline styles in react","tags":"<javascript><reactjs>","Answer_Body":"#20+'!important' is '20!important'.  \n\n#When you just give a number, react adds \"px\" for you; but you're using a string, so you have to specify the unit.  Also I'm pretty sure there needs to be a space between \"!important\" and whatever's to the left of it.\n\nstyle={{ height: '20px !important' }};\n\n"},{"Title":"!ispostback event from javascript","tags":"<asp.net><javascript-events><postback>","Answer_Body":"#Add this line to your ASPX page:\n\n&lt;% if (!this.IsPostBack) %&gt;\n&lt;% { %&gt;\n    &lt;script type=\"text\/javascript\"&gt;\n    document.getElementById(\"&lt;%= this.timeVar.ClientID %&gt;\").value = '1\/1\/2010';\n    &lt;\/script&gt;\n&lt;% } %&gt;\n\n"},{"Title":"\"'htmldocument' is undefined\" in ie8","tags":"<javascript><html><internet-explorer><internet-explorer-8>","Answer_Body":"#Ok, I found it. IE sets itself to Quirks mode for the page I've been testing it on. Unfortunately I can't set document mode in this case, so adding my own getElementsByClassName is a lost cause...\n\n#For those that can edit html document they are working on, add this meta tag to assure IE8 will act as IE8:\n\n&lt;meta http-equiv=\"X-UA-Compatible\" content=\"IE=8\"&gt;\n\n"},{"Title":"\"'window.webkitstorageinfo' is deprecated\" warning while iterating window object","tags":"<javascript><google-chrome>","Answer_Body":"#It's not something you have to worry about, If you don't want to see them, just filter it\n\nvar myObject = {};\nvar mySecondReference = myObject;\n\nfor (s in window)\n  if (!\/webkitStorageInfo|webkitIndexedDB\/.test(s) &amp;&amp; window[s]===myObject)\n    alert(\"reference found: \" + s);\n\n"},{"Title":"\"access is denied\" by executing .hta file with jscript on windows xp x64","tags":"<javascript><html><windows><scripting><64-bit>","Answer_Body":"#Try adding a try catch around the startup code\n\ntry\n{ \n    window.resizeTo(500, 300); \n} catch(e) { }\n\n\n#Alternatively try setTimeout:-\n\nsetTimeout(function() {\n    window.resizeTo(500, 300);\n}, 100);\n\n"},{"Title":"\"access is denied\" iframe ie","tags":"<javascript><iframe><permission-denied>","Answer_Body":"#Put simply, browser security won't let you communicate between two frames that are on different domains. So you can't \"grab the jQuery library\" from another frame. There's no work around or it would be a security hole in the browser.\n\n#Your only options are to do one of the following:\n\n\nNot communicate between the frames (eg. load jQuery in all frames that need it)\nHost the content of each frame on the same domain (you can work with different subdomains)\n\n"},{"Title":"\"add to favorites\" with javascript in opera","tags":"<javascript><opera>","Answer_Body":"#If you insist on it, then do it without dynamically generated redundant links:\n\n &lt;a href=\"http:\/\/real.url.example.com\" title=\"Bookmark me, pleaeease!\" \n    rel=\"sidebar\"\n    onclick=\"return !addToFav(this.href,this.title)\"&gt;\n\n\n#but please, just don't do it.\n\n#As Opera user I will be grateful for not pushing that fad – I can easily drag'n'drop tab to bookmarks bar\/panel\/speedial if I choose to.\n"}]